list.files()
  

# [4] "서울시 우리마을가게 상권분석서비스(상권-추정매출)_2015.csv"
# [5] "서울시 우리마을가게 상권분석서비스(상권-추정매출)_2016.csv"
# [6] "서울시 우리마을가게 상권분석서비스(상권-추정매출)_2017.csv"
# [7] "서울시 우리마을가게 상권분석서비스(상권-추정매출)_2018.csv"
# [8] "서울시 우리마을가게 상권분석서비스(상권-추정매출)_2019.csv"
# [9] "서울시 우리마을가게 상권분석서비스(상권-추정매출)_2020.csv"
   

# [13] "서울시_우리마을가게_상권분석서비스(상권-점포)_2015년.csv"  
# [14] "서울시_우리마을가게_상권분석서비스(상권-점포)_2016년.csv"  
# [15] "서울시_우리마을가게_상권분석서비스(상권-점포)_2017년.csv"  
# [16] "서울시_우리마을가게_상권분석서비스(상권-점포)_2018년.csv"  
# [17] "서울시_우리마을가게_상권분석서비스(상권-점포)_2019년.csv"  
# [18] "서울시_우리마을가게_상권분석서비스(상권-점포)_2020년.csv"  
wkpop<-read.csv("서울시 우리마을가게 상권분석서비스(상권-직장인구).csv" )
facility<-read.csv("서울시 우리마을가게 상권분석서비스(상권-집객시설).csv"  )
pop<- read.csv("서울시 우리마을가게 상권분석서비스(상권-추정유동인구).csv" )
repop<-read.csv("서울시 우리마을가게 상권분석서비스(상권_상주인구).csv" )
sales15<-read.csv("서울시 우리마을가게 상권분석서비스(상권-추정매출)_2015.csv")
sales16<-read.csv("서울시 우리마을가게 상권분석서비스(상권-추정매출)_2016.csv")
sales17<-read.csv("서울시 우리마을가게 상권분석서비스(상권-추정매출)_2017.csv")
sales18<-read.csv("서울시 우리마을가게 상권분석서비스(상권-추정매출)_2018.csv")
sales19<-read.csv("서울시 우리마을가게 상권분석서비스(상권-추정매출)_2019.csv")
sales20<-read.csv("서울시 우리마을가게 상권분석서비스(상권-추정매출)_2020.csv")
store15<-read.csv("서울시_우리마을가게_상권분석서비스(상권-점포)_2015년.csv")
store16<-read.csv("서울시_우리마을가게_상권분석서비스(상권-점포)_2016년.csv")
store17<-read.csv("서울시_우리마을가게_상권분석서비스(상권-점포)_2017년.csv")
store18<-read.csv("서울시_우리마을가게_상권분석서비스(상권-점포)_2018년.csv")
store19<-read.csv("서울시_우리마을가게_상권분석서비스(상권-점포)_2019년.csv")
store20<-read.csv("서울시_우리마을가게_상권분석서비스(상권-점포)_2020년.csv")

sales<-rbind(sales15,sales16,sales17,sales18,sales19,sales20)
store<-rbind(store15,store16,store17,store18,store19,store20)
rm(sales15,sales16,sales17,sales18,sales19,sales20,store15,store16,store17,store18,store19,store20)


store<-store%>%
  filter(상권_코드 %in% c(1000779,1000778,1000765,1000762,1000764,1000763,1001448,
                      1000760,1000761,1000759,1000758,1001444,1001443,
                      1000754,1000756,1000747,1001450,1000750,1000751,1000753), 
              substr(store$서비스_업종_코드,1,3)=='CS1')%>%
  arrange(상권_코드_명,서비스_업종_코드,기준_년_코드,기준_분기_코드)



facility<-facility%>%
  filter(상권_코드 %in% c(1000779,1000778,1000765,1000762,1000764,1000763,1001448,
                      1000760,1000761,1000759,1000758,1001444,1001443,
                      1000754,1000756,1000747,1001450,1000750,1000751,1000753))%>%
  arrange(상권_코드_명,기준_년_코드,기준_분기_코드)



sales<-sales%>%
  filter(상권_코드 %in% c(1000779,1000778,1000765,1000762,1000764,1000763,1001448,
                      1000760,1000761,1000759,1000758,1001444,1001443,
                      1000754,1000756,1000747,1001450,1000750,1000751,1000753),
              substr(서비스_업종_코드,1,3)=='CS1')%>%
  arrange(상권_코드_명,서비스_업종_코드,기준_년_코드,기준_분기_코드)





wkpop<-wkpop%>%
  filter(상권_코드 %in% c(1000779,1000778,1000765,1000762,1000764,1000763,1001448,
                      1000760,1000761,1000759,1000758,1001444,1001443,
                      1000754,1000756,1000747,1001450,1000750,1000751,1000753),
              기준_년월_코드 >=2015)%>%
  arrange(상권_코드_명,기준_년월_코드,기준_분기_코드)




repop<-repop%>%
  filter(상권.코드 %in% c(1000779,1000778,1000765,1000762,1000764,1000763,1001448,
                      1000760,1000761,1000759,1000758,1001444,1001443,
                      1000754,1000756,1000747,1001450,1000750,1000751,1000753),
           기준_년_코드>=2015)%>%
  arrange(상권.코드.명,기준_년_코드,기준_분기_코드)



pop<-pop%>%
  filter(상권_코드 %in% c(1000779,1000778,1000765,1000762,1000764,1000763,1001448,
                      1000760,1000761,1000759,1000758,1001444,1001443,
                      1000754,1000756,1000747,1001450,1000750,1000751,1000753),
              기준.년코드>=2015)%>%
  arrange(상권_코드_명,기준.년코드,기준_분기_코드)


sales <- sales %>%
  select(-주중_매출_비율,-주말_매출_비율,-월요일_매출_비율,-화요일_매출_비율,-수요일_매출_비율,-목요일_매출_비율,
         -금요일_매출_비율,-토요일_매출_비율,-일요일_매출_비율,
         -시간대_00.06_매출_비율,-시간대_06.11_매출_비율,-시간대_11.14_매출_비율,-시간대_14.17_매출_비율,
         -시간대_17.21_매출_비율,-시간대_21.24_매출_비율,-남성_매출_비율,-여성_매출_비율,
         -연령대_10_매출_비율,-연령대_20_매출_비율,-연령대_30_매출_비율,-연령대_40_매출_비율,-연령대_50_매출_비율,-연령대_60_이상_매출_비율,
         -주중_매출_건수,-주말_매출_건수,-월요일_매출_건수,-화요일_매출_건수,-수요일_매출_건수,-목요일_매출_건수,-금요일_매출_건수,
         -토요일_매출_건수,-일요일_매출_건수,-시간대_건수.06_매출_건수,-시간대_건수.11_매출_건수,-시간대_건수.14_매출_건수,-시간대_건수.17_매출_건수,
         -시간대_건수.21_매출_건수,-시간대_건수.24_매출_건수,-남성_매출_건수,-여성_매출_건수,-연령대_10_매출_건수,-연령대_20_매출_건수,-연령대_30_매출_건수,
         -연령대_40_매출_건수,-연령대_50_매출_건수,-연령대_60_이상_매출_건수,-점포수)



pop <- pop %>%
  select(기준.년코드,기준_분기_코드,	X.상권_구분_코드,	X.상권_구분_코드_명,	상권_코드,	상권_코드_명,	총_유동인구_수,	남성_유동인구_수,	여성_유동인구_수,	
           연령대_10_유동인구_수,	연령대_20_유동인구_수,	연령대_30_유동인구_수,	연령대_40_유동인구_수,	연령대_50_유동인구_수,	연령대_60_이상_유동인구_수,
           시간대_1_유동인구_수,	시간대_2_유동인구_수,	시간대_3_유동인구_수,	시간대_4_유동인구_수,	시간대_5_유동인구_수,	시간대_6_유동인구_수,
           월요일_유동인구_수,	화요일_유동인구_수,	수요일_유동인구_수,	목요일_유동인구_수,	금요일_유동인구_수,	토요일_유동인구_수,	일요일_유동인구_수)




repop <- repop %>%
  select(기준_년_코드,	기준_분기_코드,	상권_구분_코드,	상권_구분_코드_명,	상권.코드,	상권.코드.명,
                총.상주인구.수,	남성.상주인구.수,	여성.상주인구.수,
                여성연령대.10.상주인구.수,	여성연령대.20.상주인구.수,	여성연령대.30.상주인구.수, 	여성연령대.40.상주인구.수,	여성연령대.50.상주인구.수,	여성연령대.60.이상.상주인구.수,
                남성연령대.10.상주인구.수, 	남성연령대.20.상주인구.수,	남성연령대.30.상주인구.수,	남성연령대.40.상주인구.수,	남성연령대.50.상주인구.수,	남성연령대.60.이상.상주인구.수)



store <- store %>%
  select(기준_년_코드,	기준_분기_코드,	상권_구분_코드,	상권_구분_코드_명,	상권_코드,	상권_코드_명,
                서비스_업종_코드,	서비스_업종_코드_명,	유사_업종_점포_수,	개업_점포_수,	폐업_점포_수,	프랜차이즈_점포_수)




wkpop<- rename(wkpop,상권_구분_코드=기준_분기_코드.1)
wkpop <- wkpop %>%
  select(기준_년월_코드,	기준_분기_코드,	상권_구분_코드,	상권_구분_코드_명,	상권_코드,	상권_코드_명,
                 총_직장_인구_수	,남성_직장_인구_수,	여성_직장_인구_수,	여성연령대_10_직장_인구_수,	여성연령대_20_직장_인구_수,	여성연령대_30_직장_인구_수,	여성연령대_40_직장_인구_수,	여성연령대_50_직장_인구_수,	 여성연령대_60_이상_직장_인구_수,
                 남성연령대_10_직장_인구_수,	남성연령대_20_직장_인구_수,	남성연령대_30_직장_인구_수,	남성연령대_40_직장_인구_수,	남성연령대_50_직장_인구_수,	남성연령대_60_이상_직장_인구_수    
  )




facility[is.na(facility)]<-0
facility<-facility%>%
  mutate(총_집객시설_수 =apply(facility[,7:26],1,sum))


facility <- facility %>%
  select(기준_년_코드,	기준_분기_코드,	상권_구분_코드,	상권_구분_코드_명,	상권_코드,	상권_코드_명,
                총_집객시설_수)



##상관관계분석

test<- merge_data%>%filter(기준_년_코드==2020,기준_분기_코드==3)
train<-merge_data%>%filter(기준_년_코드<=2019|(기준_년_코드==2020 & 기준_분기_코드 !=3))

# write.csv(train,'train2015.csv',row.names = F)
# write.csv(test,'test2015.csv',row.names = F)





############################################################################################
##########매출액/점포수 컬럼 추가해서 돌렸을 때

train_data <- train %>% 
  mutate(분기_평균매출금액 = 분기_매출_금액 / 점포_수)%>%
  select(-c(분기_매출_건수,분기_매출_금액,점포_수))


map_lgl(.x =train_data[,-c(1:6,53)] , .f = function(x) {
  test<- cor.test(x= x,y= train_data$분기_평균매출금액)
  result<- test$p.value>0.05
  return(result)
})



library(stringr)
str_which(cor,'TRUE')+6

aa<-train_data[,-c(10,15:17,21,27:31,35:45,49)]
aa<-train_data[,-c(4,6)]

colnames(aa)
# [1] "기준_년_코드"               "기준_분기_코드"             "상권_코드"                 
# [4] "상권_코드_명"               "서비스_업종_코드"           "서비스_업종_코드_명"       
# [7] "총_유동인구_수"             "남성_유동인구_수"           "여성_유동인구_수"          
# [10] "연령대_20_유동인구_수"      "연령대_30_유동인구_수"      "연령대_40_유동인구_수"     
# [13] "연령대_50_유동인구_수"      "시간대_11_14_유동인구_수"   "시간대_14_17_유동인구_수"  
# [16] "시간대_17_21_유동인구_수"   "월요일_유동인구_수"         "화요일_유동인구_수"        
# [19] "수요일_유동인구_수"         "목요일_유동인구_수"         "금요일_유동인구_수"        
# [22] "연령대.10.상주인구수"       "연령대.20.상주인구수"       "연령대.30.상주인구수"      
# [25] "연령대_60_이상_직장인구_수" "총_집객시설_수"             "개업_점포_수"              
# [28] "총_확진자_수"               "서울_확진자_수"             "방학_개월수"               
# [31] "상권명"                     "분기_평균매출금액"         




##############매출액/점포수로(그냥 나누기를 넣어서) 돌렸을 때
##위에mutate한거랑 결과 같음
cor<-map_lgl(.x = train[,-c(1:6,56)], .f = function(x) { 
  test<- cor.test(x= x,y= (train$분기_매출_금액/train$점포_수)) 
  result<- test$p.value>0.05
  return(result)
}) 


# 분기_매출_금액             분기_매출_건수             총_유동인구_수 
# FALSE                      FALSE                      FALSE 
# 남성_유동인구_수           여성_유동인구_수      
# FALSE                      FALSE                      
# 연령대_20_유동인구_수      연령대_30_유동인구_수      연령대_40_유동인구_수 
# FALSE                      FALSE                      FALSE 
# 연령대_50_유동인구_수 
# FALSE                       
# 시간대_11_14_유동인구_수   시간대_14_17_유동인구_수 
# FALSE                      FALSE 
# 시간대_17_21_유동인구_수   월요일_유동인구_수 
# FALSE                      FALSE 
# 화요일_유동인구_수         수요일_유동인구_수         목요일_유동인구_수 
# FALSE                      FALSE                      FALSE 
# 금요일_유동인구_수      
# 연령대.10.상주인구수       연령대.20.상주인구수       연령대.30.상주인구수 
# FALSE                      FALSE                      FALSE 
# 연령대_60_이상_직장인구_수 
# FALSE 
# 총_집객시설_수            점포_수               개업_점포_수 
# FALSE                      FALSE                      FALSE 
# 총_확진자_수             서울_확진자_수 
# FALSE                      FALSE 
# 방학_개월수 
# FALSE 

library(stringr)
str_which(cor,'TRUE')+6

aa<-train[,-c(12 ,17:19, 23, 29:33, 37:47, 52)]
bb<-test[,-c(12 ,17:19, 23, 29:33, 37:47, 52)]


# write.csv(train,"merge_train_Rtree.csv",row.names = F)
# write.csv(test,"merge_test_Rtree.csv",row.names = F)



library(psych)
a<-merge_train[,-c(1:4,33)]
cor<-cor(a)
pairs.panels(a)
library(PerformanceAnalytics)
chart.Correlation(a, histogram=TRUE, pch=19)
library(corrplot)
corrplot(cor(a,use="na.or.complete"))





#####2019~2020
cor<-map_lgl(.x = merge_data[,-c(1:6,53,54)], .f = function(x) { 
  test<- cor.test(x= x,y= (merge_data$분기_매출_금액/merge_data$점포_수)) 
  result<- test$p.value>0.05
  return(result)
}) 

library(stringr)
str_which(cor,'TRUE')+6

merge_data<-read.csv("merge_data.csv")
merge_test<-read.csv("merge_data_test.csv")

merge_data<- merge_data[,-c(29:37, 39, 42:45, 48,49,51:53)]
merge_test<- merge_test[,-c(29:37, 39, 42:45, 48,49,51:53)]
merge_data<- merge_data[,-c(4,6)]
merge_test<- merge_test[,-c(4,6)]

train_mod<-train_mod%>%
  mutate(서비스_업종_코드=factor(x=서비스_업종_코드),
                  상권명=factor(x=상권명))
test_mod<-test_mod%>%
  mutate(서비스_업종_코드=factor(x=서비스_업종_코드),
                  상권명=factor(x=상권명))
# write.csv(merge_data,"merge_data_modeling.csv",row.names = F)
# write.csv(merge_test,"merge_test_modeling.csv",row.names = F)


